/* 
226 IM Used ==>
البيانات موجودة مسبقا
400 Bad Request==>
لا يمكن تلبية الطلب بسبب سوء بناء الجملة.  بعض الأمثلة على ذلك أخطاء التحقق من صحة المجال ، والبيانات المفقودة ، وما إلى ذلك.

401 Unauthorized==>
 غير مصادق

402 Payment Required ==>
الدفع مطلوب

403 Forbidden ==>
 الوصول غير مسموح

404 Not Found ==>
تعذر العثور على المورد المطلوب ولكن قد يكون متاحًا مرة أخرى في المستقبل. الطلبات اللاحقة من قبل العميل مسموح بها.

407 Proxy Authentication Required==>
  يجب على العميل أولاً مصادقة نفسه مع الوكيل.


408 Request Timeout ==>
انتهت مهلة الخادم في انتظار الطلب.


411 Length Required  ==> الطول المطلوب للبيانات المراد جلبة
لم يحدد الطلب طول المحتوى المطلوب من قبل المورد المطلوب.


412 Precondition Failed==> 
عدم استيفاء الخادم لأحد الشروط المسبقة التي وضعها مقدم الطلب في الطلب.

413 Payload Too Large ==>
الطلب أكبر مما يرغب الخادم أو يمكنه معالجته.

415 Unsupported Media Type==>
 نوع وسائط غير مدعوم مثل انواع الصور و الملفات

423 Locked ==>
المورد الذي يتم الوصول إليه مقفل.

424 Failed Dependency==>
فشل الطلب بسبب فشل طلب سابق 

449 Retry With==>
. يجب إعادة محاولة الطلب بعد تنفيذ الإجراء المناسب


500 Internal Server Error==>
رسالة خطأ عامة ، تُعطى عندما لا تكون هناك رسالة أكثر تحديدًا مناسبة.

 خطأ استقبال الرسائل الخاطئة العام عندما يطرح جانب الخادم استثناءً.

409 Conflict ==>
 يشير (الصراع) قانون الأحوال أن الطلب لا يمكن أن تكتمل بسبب صراع مع الوضع الحالي للموارد المستهدفة. 


422 Unprocessable Entity==> 
كيان غير قابل للمعالجة او بيانات غير قابلة للمعالجة






400==>validation fild
226 ==>emial already exist
500==>catch error
409==>invalid data or ==> 422
*/