/* 
5xx خطأ في الخادم



 ==============>500 خطأ خادم داخلي
واجه الخادم حالة غير متوقعة منعته من تلبية الطلب.

ويكيبيديا
رسالة خطأ عامة ، تُعطى عندما لا تكون هناك رسالة أكثر تحديدًا مناسبة.

 خطأ استقبال الرسائل الخاطئة العام عندما يطرح جانب الخادم استثناءً.



============>501 لم يتم التنفيذ
الخادم لا يدعم الوظيفة المطلوبة لاستيفاء الطلب. هذه هي الاستجابة المناسبة عندما لا يتعرف الخادم على طريقة الطلب ولا يكون قادرًا على دعمها لأي مورد.

ويكيبيديا
إما أن الخادم لا يتعرف على طريقة الطلب ، أو أنه يفتقر إلى القدرة على تلبية الطلب.






==================>502 مدخل غير صالح
تلقى الخادم ، أثناء عمله كبوابة أو وكيل ، استجابة غير صالحة من الخادم الرئيسي الذي تم الوصول إليه في محاولة لتلبية الطلب.

ويكيبيديا
كان الخادم يعمل كبوابة أو وكيل وتلقى استجابة غير صالحة من الخادم الرئيسي.



===========>503 الخدمة غير متوفرة
يتعذر على الخادم حاليًا معالجة الطلب بسبب التحميل الزائد المؤقت أو صيانة الخادم. والمقصود أن هذه حالة مؤقتة تزول بعد بعض التأخير. إذا كان معروفًا ، فقد تتم الإشارة إلى طول التأخير في رأس Retry-After. إذا لم يتم تقديم إعادة المحاولة ، يجب على العميل معالجة الاستجابة كما لو كانت استجابة 500.

ملاحظة: لا يعني وجود رمز الحالة 503 أن الخادم يجب أن يستخدمه عندما يصبح محملاً بشكل زائد. قد ترغب بعض الخوادم ببساطة في رفض الاتصال.
ويكيبيديا
الخادم غير متاح حاليًا (بسبب زيادة التحميل عليه أو تعطله للصيانة). بشكل عام ، هذه حالة مؤقتة.



===========>البوابة 504 انتهى الزمن
الخادم ، أثناء عمله كبوابة أو وكيل ، لم يتلق استجابة في الوقت المناسب من الخادم الرئيسي المحدد بواسطة URI (على سبيل المثال HTTP ، FTP ، LDAP) أو بعض الخوادم المساعدة الأخرى (مثل DNS) التي يحتاجها للوصول لمحاولة إكمال الطلب.

ملاحظة: ملاحظة للمنفذين: من المعروف أن بعض الوكلاء المنشورين يعرضون 400 أو 500 عندما تنتهي مهلة بحث DNS.
ويكيبيديا
كان الخادم يعمل كبوابة أو وكيل ولم يتلق استجابة في الوقت المناسب من الخادم الرئيسي.


===========>505 إصدار HTTP غير مدعوم
لا يدعم الخادم أو يرفض دعم إصدار بروتوكول HTTP الذي تم استخدامه في رسالة الطلب. يشير الخادم إلى أنه غير قادر أو غير راغب في إكمال الطلب باستخدام نفس الإصدار الرئيسي مثل العميل ، كما هو موضح في القسم 3.1 ، بخلاف رسالة الخطأ هذه. يجب أن تحتوي الاستجابة على كيان يصف سبب عدم دعم هذا الإصدار وما هي البروتوكولات الأخرى التي يدعمها هذا الخادم.

ويكيبيديا
لا يدعم الخادم إصدار بروتوكول HTTP المستخدم في الطلب.

===========>506 متغير يفاوض أيضًا (تجريبي)
يشير رمز الحالة 506 إلى أن الخادم به خطأ تكوين داخلي: تم تكوين مورد المتغير المختار للمشاركة في تفاوض محتوى شفاف بحد ذاته ، وبالتالي فهو ليس نقطة نهاية مناسبة في عملية التفاوض.

ويكيبيديا
ينتج عن تفاوض المحتوى الشفاف للطلب مرجع معاد.


=============>507 مساحة تخزين غير كافية (WebDAV)
رمز الحالة 507 (التخزين غير الكافي) يعني أنه لا يمكن تنفيذ الطريقة على المورد لأن الخادم غير قادر على تخزين التمثيل المطلوب لإكمال الطلب بنجاح. تعتبر هذه الحالة مؤقتة. إذا كان الطلب الذي تلقى رمز الحالة هذا نتيجة لإجراء مستخدم ، فيجب عدم تكرار الطلب حتى يتم طلبه من خلال إجراء مستخدم منفصل.

ويكيبيديا
الخادم غير قادر على تخزين التمثيل المطلوب لإكمال الطلب.


=============>508 حلقة تم اكتشافها (WebDAV)
يشير رمز الحالة 508 (تم اكتشاف حلقة) إلى أن الخادم أنهى عملية ما لأنه واجه حلقة لا نهائية أثناء معالجة طلب بـ "Depth: infinity". تشير هذه الحالة إلى فشل العملية بأكملها.

ويكيبيديا
اكتشف الخادم حلقة لا نهائية أثناء معالجة الطلب (تم الإرسال بدلاً من 208).


م تجاوز حد عرض النطاق الترددي =========>509 (Apache)
ويكيبيديا
لم يتم تحديد رمز الحالة هذا ، أثناء استخدامه بواسطة العديد من الخوادم ، في أي من طلبات التعليقات (RFC).




===========>510 غير ممتد
لم يتم استيفاء سياسة الوصول إلى المورد في الطلب. يجب أن يرسل الخادم جميع المعلومات اللازمة للعميل لإصدار طلب موسع. يعد تحديد كيفية إبلاغ الامتدادات للعميل خارج نطاق هذه المواصفات.

إذا كانت الاستجابة 510 تحتوي على معلومات حول الامتدادات التي لم تكن موجودة في الطلب الأولي ، فيجوز للعميل أن يكرر الطلب إذا كان لديه سبب للاعتقاد بأنه يمكن أن يفي بسياسة التمديد عن طريق تعديل الطلب وفقًا للمعلومات المقدمة في استجابة 510. وبخلاف ذلك ، يجوز للعميل تقديم أي كيان مدرج في استجابة 510 للمستخدم ، نظرًا لأن هذا الكيان قد يتضمن معلومات تشخيصية ذات صلة.

ويكيبيديا
مزيد من التمديدات للطلب مطلوبة للخادم للوفاء به.




============>مطلوب 511 مصادقة الشبكة
يشير رمز الحالة 511 إلى أن العميل يحتاج إلى المصادقة للوصول إلى الشبكة.

يجب أن يحتوي تمثيل الاستجابة على ارتباط إلى مورد يسمح للمستخدم بإرسال بيانات الاعتماد (على سبيل المثال باستخدام نموذج HTML).

لاحظ أن الرد 511 يجب ألا يحتوي على اختبار أو واجهة تسجيل الدخول نفسها ، لأن المتصفحات ستُظهر واجهة تسجيل الدخول على أنها مرتبطة بعنوان URL المطلوب في الأصل ، مما قد يتسبب في حدوث ارتباك.

يجب ألا يتم إنشاء الحالة 511 بواسطة الخوادم الأصلية ؛ الغرض منه هو استخدامه من خلال اعتراض الوكلاء الذين يتم تداخلهم كوسيلة للتحكم في الوصول إلى الشبكة.

يجب ألا يتم تخزين الردود مع رمز الحالة 511 بواسطة ذاكرة التخزين المؤقت.

تم تصميم رمز الحالة 511 للتخفيف من المشكلات التي تسببها "البوابات المقيدة" للبرامج (خاصة الوكلاء غير المستعرضين) التي تتوقع استجابة من الخادم الذي تم تقديم طلب إليه ، وليس البنية التحتية للشبكة المتداخلة. ليس المقصود تشجيع نشر البوابات الأسيرة ، فقط للحد من الأضرار التي تسببها.

مشغل الشبكة الذي يرغب في طلب بعض المصادقة أو قبول الشروط أو تفاعل مستخدم آخر قبل منح الوصول يفعل ذلك عادةً عن طريق تحديد العملاء الذين لم يفعلوا ذلك ("عملاء غير معروفين") باستخدام عناوين MAC الخاصة بهم.

بعد ذلك ، يتم حظر جميع حركات المرور للعملاء غير المعروفين ، باستثناء تلك الموجودة على منفذ TCP 80 ، والذي يتم إرساله إلى خادم HTTP ("خادم تسجيل الدخول") المخصص "لتسجيل الدخول" للعملاء غير المعروفين ، وبالطبع حركة المرور إلى خادم تسجيل الدخول نفسه.

في الاستخدام الشائع ، لن تأتي الاستجابة التي تحمل رمز الحالة 511 من الخادم الأصلي المشار إليه في عنوان URL الخاص بالطلب. يقدم هذا العديد من القضايا الأمنية ؛ على سبيل المثال ، قد يقوم الوسيط المهاجم بإدخال ملفات تعريف الارتباط في مساحة اسم المجال الأصلي ، وقد يراقب ملفات تعريف الارتباط أو بيانات اعتماد مصادقة HTTP المرسلة من وكيل المستخدم ، وما إلى ذلك.

ومع ذلك ، فإن هذه المخاطر ليست فريدة في رمز الحالة 511 ؛ بمعنى آخر ، البوابة المقيدة التي لا تستخدم رمز الحالة هذا تقدم نفس المشكلات.

لاحظ أيضًا أن البوابات المقيدة التي تستخدم رمز الحالة هذا على اتصال SSL أو TLS (عادةً ، المنفذ 443) ستنشئ خطأ في الشهادة على العميل.

ويكيبيديا
يحتاج العميل إلى المصادقة للوصول إلى الشبكة. مُعد للاستخدام عن طريق اعتراض الوكلاء المُستخدمين للتحكم في الوصول إلى الشبكة (على سبيل المثال ، "البوابات المقيدة" المستخدمة لطلب الموافقة على شروط الخدمة قبل منح الوصول الكامل إلى الإنترنت عبر نقطة اتصال Wi-Fi).


============>598 خطأ انتهاء مهلة قراءة الشبكة
ويكيبيديا
لم يتم تحديد رمز الحالة هذا في أي RFCs ، ولكن يتم استخدامه بواسطة بعض وكلاء HTTP للإشارة إلى انتهاء مهلة قراءة الشبكة خلف الوكيل إلى العميل أمام الوكيل.





=============>599 خطأ مهلة الاتصال بالشبكة
ويكيبيديا
لم يتم تحديد رمز الحالة هذا في أي RFCs ، ولكن يتم استخدامه بواسطة بعض وكلاء HTTP للإشارة إلى انتهاء مهلة اتصال الشبكة خلف الوكيل إلى العميل أمام الوكيل.












*/